In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as mlt
import seaborn as sns
from scipy.stats import f_oneway

In [3]:
#load the data
df=pd.read_csv('Advertising.csv')

In [4]:
df.head()

   Unnamed: 0     TV  Radio  Newspaper  Sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4
2           3   17.2   45.9       69.3    9.3
3           4  151.5   41.3       58.5   18.5
4           5  180.8   10.8       58.4   12.9

In [5]:
df.isna().sum()

Unnamed: 0    0
TV            0
Radio         0
Newspaper     0
Sales         0
dtype: int64

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  200 non-null    int64
 1   TV          200 non-null    float64
 2   Radio       200 non-null    float64
 3   Newspaper   200 non-null    float64
 4   Sales       200 non-null    float64
dtypes: float64(4), int64(1)
memory usage: 7.9 KB

In [7]:
df.describe()

       Unnamed: 0          TV       Radio   Newspaper       Sales
count  200.000000  200.000000  200.000000  200.000000  200.000000
mean   100.500000  147.042500   23.264000   30.554000   14.022500
std     57.879185   85.854236   14.846809   21.778621    5.217457
min      1.000000    0.700000    0.000000    0.300000    1.600000
25%     50.750000   74.375000    9.975000   12.750000   10.375000
50%    100.500000  149.750000   22.900000   25.750000   12.900000
75%    150.250000  218.825000   36.525000   45.100000   17.400000
max    200.000000  296.400000   49.600000  114.000000   27.000000

Null hypothesis:- We assume that mean of  radio=TV=Newspaper


alternative hypothesis:= Atleast one sample is different

In [8]:
TV=df['TV']

In [9]:
TV

0      230.1
1       44.5
2       17.2
3      151.5
4      180.8
       ...
195     38.2
196     94.2
197    177.0
198    283.6
199    232.1
Name: TV, Length: 200, dtype: float64

In [10]:
Radio=df['Radio']
Radio

0      37.8
1      39.3
2      45.9
3      41.3
4      10.8
       ...
195     3.7
196     4.9
197     9.3
198    42.0
199     8.6
Name: Radio, Length: 200, dtype: float64

In [11]:
Newspaper=df['Newspaper']
Newspaper

0      69.2
1      45.1
2      69.3
3      58.5
4      58.4
       ...
195    13.8
196     8.1
197     6.4
198    66.2
199     8.7
Name: Newspaper, Length: 200, dtype: float64

In [13]:
fstat,pvalue=f_oneway(TV,Radio,Newspaper)
print('F-Statistics value is: ',fstat)
print('P-value is: ',pvalue)
if pvalue<0.05:
    print('We reject null hypothesis and conclude that atleast one sample is different')
else:
    print('We accept null hypothesis and conclude that our samples have same mean')

F-Statistics value is:  358.8514595342597
P-value is:  4.552931539744962e-103
We reject null hypothesis and conclude that atleast one sample is different